Revit 2024 API
EnergyDataSettings.PercentageGlazing Property
 Used for the conceptual energy model. The approximate percentage of the building exterior wall surfaces which are covered by windows or other glazing.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double PercentageGlazing { get; set; }
Visual Basic
Public Property PercentageGlazing As Double
	Get
	Set
Visual C++
public:
property double PercentageGlazing {
	double get ();
	void set (double value);
}
Remarks
 This value is used to automatically model these glazed openings in massing instances for the Conceptual Energy Analytical Model.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The percentage glazing value is not between 0.00 and 0.95.
See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace